[
  {
    "id": "117bd86a-5aa7-4fe6-bd4b-0f946fae487c",
    "userId": "39333f70-4760-45d1-bc00-d72263be6d59",
    "farmName": "Prairie Gold Organic Farm",
    "description": "Family-owned organic farm specializing in fresh vegetables and sustainable farming practices. We have been serving the local community for over 20 years with the highest quality produce.",
    "location": "Saskatoon, SK",
    "farmHistory": "Founded in 1985 by the Johnson family, Prairie Gold Organic Farm started as a small 5-acre plot and has grown to a 2,400-acre certified organic operation. We focus on sustainable farming methods, crop rotation, and natural pest management to provide the freshest, healthiest produce to our community.",
    "averageRating": 4.8,
    "totalReviews": 12,
    "createdAt": "2025-09-27T22:52:54.673Z",
    "updatedAt": "2025-09-27T22:52:54.781Z",
    "ourStory": "My name is Klark Kent, and farming has been in my blood for three generations. When my grandfather first tilled the soil here in 1985, he dreamed of creating a place where families could get the freshest, most nutritious vegetables while respecting the land that provides for us. Today, I carry on that dream with my husband Mike and our three children. Every morning, I wake up grateful to work the same land that taught me the value of hard work, patience, and the incredible cycle of life. Our farm isn't just our livelihood—it's our home, our classroom, and our way of giving back to the community that has supported us for nearly four decades.",
    "aboutOurFarm": "Prairie Gold Organic Farm spans 2,400 acres of certified organic land in the heart of Saskatchewan's fertile prairies. We grow over 50 varieties of vegetables using sustainable farming practices that have been refined over three generations. Our fields are managed with crop rotation, cover cropping, and natural pest management to maintain soil health and biodiversity. We operate a 15,000-square-foot greenhouse for year-round production of tomatoes, peppers, and leafy greens. Our farm also includes a 200-acre pollinator habitat, a composting facility that processes 500 tons of organic matter annually, and a solar-powered irrigation system. We're proud to be certified organic by Pro-Cert and are members of the Saskatchewan Organic Directorate. Our commitment to sustainability extends beyond our fields—we use electric vehicles for local deliveries, package our products in biodegradable materials, and donate surplus produce to local food banks.",
    "farmerPhoto": "https://images.unsplash.com/photo-1507003211169-0a1dd7228f2d?w=400&h=400&fit=crop&crop=face",
    "farmPhotos": [
      {
        "id": "farm1",
        "url": "https://images.unsplash.com/photo-1500382017468-9049fed747ef?w=600&h=400&fit=crop",
        "caption": "Our main field during peak growing season",
        "type": "farm",
        "createdAt": "2025-09-27T22:52:54.673Z"
      },
      {
        "id": "farm2",
        "url": "https://images.unsplash.com/photo-1574943320219-553eb213f72d?w=600&h=400&fit=crop",
        "caption": "Greenhouse operations for year-round production",
        "type": "farm",
        "createdAt": "2025-09-27T22:52:54.673Z"
      },
      {
        "id": "farm3",
        "url": "https://images.unsplash.com/photo-1582510003544-4d00b7f74220?w=600&h=400&fit=crop",
        "caption": "Pollinator habitat supporting local bee populations",
        "type": "landscape",
        "createdAt": "2025-09-27T22:52:54.673Z"
      }
    ],
    "workPhotos": [
      {
        "id": "work1",
        "url": "https://images.unsplash.com/photo-1500937386664-56d1dfef3854?w=600&h=400&fit=crop",
        "caption": "Harvesting organic tomatoes in our greenhouse",
        "type": "harvesting",
        "createdAt": "2025-09-27T22:52:54.673Z"
      },
      {
        "id": "work2",
        "url": "https://images.unsplash.com/photo-1416879595882-3373a0480b5b?w=600&h=400&fit=crop",
        "caption": "Sorting and packaging fresh vegetables",
        "type": "packaging",
        "createdAt": "2025-09-27T22:52:54.673Z"
      }
    ],
    "timeline": [
      {
        "id": "timeline1",
        "year": 1985,
        "title": "Farm Founded",
        "description": "My grandfather, Robert Johnson, purchased 5 acres of land and began growing vegetables using traditional methods.",
        "type": "founding"
      },
      {
        "id": "timeline2",
        "year": 1995,
        "title": "First Organic Certification",
        "description": "Became one of the first certified organic farms in Saskatchewan, pioneering sustainable agriculture in the region.",
        "type": "achievement"
      },
      {
        "id": "timeline3",
        "year": 2005,
        "title": "Major Expansion",
        "description": "Expanded to 500 acres and built our first greenhouse, allowing for year-round production.",
        "type": "expansion"
      },
      {
        "id": "timeline4",
        "year": 2015,
        "title": "Solar Power Installation",
        "description": "Installed a 100kW solar array, making our farm 100% renewable energy powered.",
        "type": "milestone"
      },
      {
        "id": "timeline5",
        "year": 2020,
        "title": "Saskatchewan Farm of the Year",
        "description": "Awarded Saskatchewan Farm of the Year for our commitment to sustainability and community involvement.",
        "type": "award"
      },
      {
        "id": "timeline6",
        "year": 2023,
        "title": "Third Generation Leadership",
        "description": "I took over full management of the farm, bringing fresh ideas while honoring our family's traditions.",
        "type": "milestone"
      }
    ]
  },
  {
    "id": "2a8f9c3e-1b4d-4e7f-8a2c-9d6e5f3a1b8c",
    "userId": "7f8e9d2a-3c4b-5e6f-7a8b-9c0d1e2f3a4b",
    "farmName": "Northern Lights Dairy",
    "description": "Premium dairy farm producing fresh milk, cheese, and yogurt from grass-fed cows. We pride ourselves on animal welfare and sustainable practices.",
    "location": "Regina, SK",
    "farmHistory": "Established in 1992, Northern Lights Dairy has been a family tradition for three generations. Our 800-acre farm is home to 150 Holstein cows that graze on organic pastures. We use traditional cheese-making methods passed down through generations.",
    "averageRating": 4.6,
    "totalReviews": 8,
    "createdAt": "2025-09-27T23:15:30.000Z",
    "updatedAt": "2025-09-27T23:15:30.000Z"
  },
  {
    "id": "3b9e0d4f-2c5e-5f8a-9b3d-0e7f8a1b2c3d",
    "userId": "8a9b0c1d-4e5f-6a7b-8c9d-0e1f2a3b4c5d",
    "farmName": "Saskatchewan Valley Produce",
    "description": "Leading producer of root vegetables and field crops. We specialize in potatoes, carrots, onions, and other vegetables grown in the rich Saskatchewan soil.",
    "location": "Prince Albert, SK",
    "farmHistory": "Since 1978, Saskatchewan Valley Produce has been growing over 20 varieties of vegetables using integrated pest management. Our 3,200-acre operation includes heritage varieties and modern favorites, all grown in the fertile Saskatchewan soil.",
    "averageRating": 4.9,
    "totalReviews": 15,
    "createdAt": "2025-09-27T23:20:45.000Z",
    "updatedAt": "2025-09-27T23:20:45.000Z"
  },
  {
    "id": "4c0f1e5a-3d6f-6a9b-0c4e-1f8a9b2c3d4e",
    "userId": "9b0c1d2e-5f6a-7b8c-9d0e-1f2a3b4c5d6e",
    "farmName": "Prairie Breeze Ranch",
    "description": "Sustainable livestock operation with pasture-raised animals. We offer premium beef, lamb, and pork from animals raised on our Saskatchewan pastures.",
    "location": "Moose Jaw, SK",
    "farmHistory": "Started in 1995 as a family operation, Prairie Breeze Ranch has grown into a sustainable livestock destination. Our 1,500-acre ranch uses rotational grazing and focuses on animal welfare to produce the highest quality meat.",
    "averageRating": 4.7,
    "totalReviews": 22,
    "createdAt": "2025-09-27T23:25:15.000Z",
    "updatedAt": "2025-09-27T23:25:15.000Z"
  },
  {
    "id": "5d1a2f6b-4e7a-7b0c-1d5f-2a9b0c3d4e5f",
    "userId": "0c1d2e3f-6a7b-8c9d-0e1f-2a3b4c5d6e7f",
    "farmName": "Prairie Heritage Grains",
    "description": "Traditional grain farm producing wheat, barley, oats, and specialty grains. We mill our own flour and offer fresh-baked goods at our farm store.",
    "location": "North Battleford, SK",
    "farmHistory": "A fourth-generation family farm established in 1983. Our 4,000-acre operation focuses on sustainable grain production and soil conservation. We've recently added a stone mill to process our heritage grains into fresh flour.",
    "averageRating": 4.6,
    "totalReviews": 6,
    "createdAt": "2025-09-27T23:30:30.000Z",
    "updatedAt": "2025-09-27T23:30:30.000Z"
  },
  {
    "id": "6e2b3a7c-5f8b-8c1d-2e6a-3b0c1d4e5f6a",
    "userId": "1d2e3f4a-7b8c-9d0e-1f2a-3b4c5d6e7f8a",
    "farmName": "Greenfield Organic Gardens",
    "description": "Certified organic vegetable production and greenhouse operations. We specialize in vegetables, herbs, microgreens, and organic produce year-round.",
    "location": "Yorkton, SK",
    "farmHistory": "Founded in 1989, Greenfield Organic Gardens combines traditional growing knowledge with modern technology. Our 600-acre certified organic operation allows us to provide fresh produce year-round while using sustainable farming practices.",
    "averageRating": 4.8,
    "totalReviews": 18,
    "createdAt": "2025-09-27T23:35:45.000Z",
    "updatedAt": "2025-09-27T23:35:45.000Z"
  },
  {
    "id": "80967d9c-fa7b-48c0-8e32-d462e12fe01e",
    "userId": "d14838b4-53d3-42d3-9144-771176426667",
    "farmName": "Jane & Sons Famrs",
    "description": "descuprion, is yrjsdnmmbc xwe",
    "location": "Winnipeg, Manitoba",
    "farmHistory": "",
    "averageRating": 0,
    "totalReviews": 0,
    "createdAt": "2025-09-28T09:54:35.226Z",
    "updatedAt": "2025-09-28T09:54:35.226Z"
  }
]