[
  {
    "id": "117bd86a-5aa7-4fe6-bd4b-0f946fae487c",
    "userId": "39333f70-4760-45d1-bc00-d72263be6d59",
    "farmName": "Green Valley Organic Farm",
    "description": "Family-owned organic farm specializing in fresh vegetables and sustainable farming practices. We have been serving the local community for over 20 years with the highest quality produce.",
    "location": "Sonoma County, California",
    "farmHistory": "Founded in 2003 by the Johnson family, Green Valley Organic Farm started as a small 5-acre plot and has grown to a 50-acre certified organic operation. We focus on sustainable farming methods, crop rotation, and natural pest management to provide the freshest, healthiest produce to our community.",
    "averageRating": 4.8,
    "totalReviews": 12,
    "createdAt": "2025-09-27T22:52:54.673Z",
    "updatedAt": "2025-09-27T22:52:54.781Z"
  },
  {
    "id": "2a8f9c3e-1b4d-4e7f-8a2c-9d6e5f3a1b8c",
    "userId": "7f8e9d2a-3c4b-5e6f-7a8b-9c0d1e2f3a4b",
    "farmName": "Sunrise Meadows Dairy",
    "description": "Premium dairy farm producing fresh milk, cheese, and yogurt from grass-fed cows. We pride ourselves on animal welfare and sustainable practices.",
    "location": "Vermont, New England",
    "farmHistory": "Established in 1995, Sunrise Meadows has been a family tradition for three generations. Our 200-acre farm is home to 150 Holstein cows that graze on organic pastures. We use traditional cheese-making methods passed down through generations.",
    "averageRating": 4.9,
    "totalReviews": 8,
    "createdAt": "2025-09-27T23:15:30.000Z",
    "updatedAt": "2025-09-27T23:15:30.000Z"
  },
  {
    "id": "3b9e0d4f-2c5e-5f8a-9b3d-0e7f8a1b2c3d",
    "userId": "8a9b0c1d-4e5f-6a7b-8c9d-0e1f2a3b4c5d",
    "farmName": "Mountain View Apple Orchard",
    "description": "Specializing in heirloom apple varieties and fresh apple products. Our orchard offers pick-your-own experiences and farm-to-table dining.",
    "location": "Hudson Valley, New York",
    "farmHistory": "Since 1988, Mountain View has been growing over 50 varieties of apples using integrated pest management. Our 75-acre orchard includes heritage varieties like Northern Spy and Winesap, plus modern favorites like Honeycrisp.",
    "averageRating": 4.7,
    "totalReviews": 15,
    "createdAt": "2025-09-27T23:20:45.000Z",
    "updatedAt": "2025-09-27T23:20:45.000Z"
  },
  {
    "id": "4c0f1e5a-3d6f-6a9b-0c4e-1f8a9b2c3d4e",
    "userId": "9b0c1d2e-5f6a-7b8c-9d0e-1f2a3b4c5d6e",
    "farmName": "Heritage Berry Farm",
    "description": "Small-scale berry farm growing strawberries, blueberries, raspberries, and blackberries. We offer seasonal u-pick and pre-picked berries.",
    "location": "Willamette Valley, Oregon",
    "farmHistory": "Started in 2010 as a retirement project, Heritage Berry Farm has grown into a beloved local destination. Our 15-acre farm uses organic methods and focuses on soil health to produce the sweetest, most flavorful berries.",
    "averageRating": 4.6,
    "totalReviews": 22,
    "createdAt": "2025-09-27T23:25:15.000Z",
    "updatedAt": "2025-09-27T23:25:15.000Z"
  },
  {
    "id": "5d1a2f6b-4e7a-7b0c-1d5f-2a9b0c3d4e5f",
    "userId": "0c1d2e3f-6a7b-8c9d-0e1f-2a3b4c5d6e7f",
    "farmName": "Golden Fields Wheat & Grain",
    "description": "Traditional grain farm producing wheat, barley, oats, and specialty grains. We mill our own flour and offer fresh-baked goods at our farm store.",
    "location": "Kansas Plains, Kansas",
    "farmHistory": "A fourth-generation family farm established in 1920. Our 500-acre operation focuses on sustainable grain production and soil conservation. We've recently added a stone mill to process our grains into fresh flour.",
    "averageRating": 4.5,
    "totalReviews": 6,
    "createdAt": "2025-09-27T23:30:30.000Z",
    "updatedAt": "2025-09-27T23:30:30.000Z"
  },
  {
    "id": "6e2b3a7c-5f8b-8c1d-2e6a-3b0c1d4e5f6a",
    "userId": "1d2e3f4a-7b8c-9d0e-1f2a-3b4c5d6e7f8a",
    "farmName": "Coastal Greenhouse Gardens",
    "description": "Year-round greenhouse operation specializing in tomatoes, peppers, herbs, and microgreens. We use advanced hydroponic systems for consistent quality.",
    "location": "San Diego County, California",
    "farmHistory": "Founded in 2015, Coastal Greenhouse Gardens combines traditional growing knowledge with modern technology. Our 10,000 sq ft greenhouse facility allows us to provide fresh produce year-round while using 90% less water than traditional farming.",
    "averageRating": 4.8,
    "totalReviews": 18,
    "createdAt": "2025-09-27T23:35:45.000Z",
    "updatedAt": "2025-09-27T23:35:45.000Z"
  }
]